tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/command-not-found"

cask "xquartz"

# The Blackmagic Design Decklink Software Development Kit libraries
tap "amiaopensource/amiaos"
brew "amiaopensource/amiaos/decklinksdk"

# Organize Your macOS Launchpad Apps.
tap "blacktop/tap"
brew "blacktop/tap/lporg"

# Bash scripts that integrate bat with various command-line tools
tap "eth-p/software"
brew "eth-p/software/bat-extras"

# Play, record, convert, and stream audio and video
tap "homebrew-ffmpeg/ffmpeg"
brew "ffmpeg", args: ["with-fdk-aac", "with-game-music-emu", "with-libbluray", "with-libbs2b", "with-libcaca", "with-libgsm", "with-libmodplug", "with-librsvg", "with-libsoxr", "with-libssh", "with-libvidstab", "with-libvmaf", "with-libxml2", "with-opencore-amr", "with-openh264", "with-openjpeg", "with-openssl", "with-rtmpdump", "with-rubberband", "with-speex", "with-srt", "with-tesseract", "with-two-lame", "with-wavpack", "with-webp", "with-xvid", "with-zeromq", "with-zimg"]

# Runs commands around a parent process
tap "thefox/brewery"
brew "thefox/brewery/phook"

# Runs layouts of windows and panes in iTerm2
tap "tomanthony/brews"
brew "tomanthony/brews/itermocil"

# Maintained ctags implementation
tap "universal-ctags/universal-ctags"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# Formatter/translator for text files to numerous formats. Includes a2x
brew "asciidoc"

# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"

# Archival front-end
brew "atool"

# Shell extension to jump to frequently used directories
brew "autojump"

# Tool for generating GNU Standards-compliant Makefiles
brew "automake"

# Text processing scripting language
brew "awk"

# Bourne-Again SHell, a UNIX command interpreter
brew "bash"

# Programmable completion for Bash 4.1+
brew "bash-completion"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Collection of portable C++ source libraries
brew "boost"

# Data interchange format and capability-based RPC system
brew "capnp"

# Core component of the AcoustID project (Audio fingerprinting)
brew "chromaprint"

# Cross-platform make
brew "cmake"

# Console Matrix
brew "cmatrix"

# GNU File, Shell, and Text utilities
brew "coreutils"

# Configurable talking characters in ASCII art
brew "cowsay"

# Tool for browsing source code
brew "cscope"

# Get a file from an HTTP, HTTPS or FTP server
brew "curl"

# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"

# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"

# Generate documentation for several programming languages
brew "doxygen"

# Program that can automate interactive applications
brew "expect"

# Standalone library of the Fraunhofer FDK AAC code from Android
brew "fdk-aac"

# Banner-like program prints strings as ASCII art
brew "figlet"

# Infamous electronic fortune-cookie generator
brew "fortune"

# GNU compiler collection
brew "gcc"

# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"

# Distributed revision control system
brew "git"

# Quickly rewrite git repository history
brew "git-filter-repo"

# Core application library for C
brew "glib"

# Command-line option parsing utility
brew "gnu-getopt"

# GNU implementation of the famous stream editor
brew "gnu-sed"

# GNU version of the tar archiving utility
brew "gnu-tar"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"

# Extremely memory-efficient hash_map implementation
brew "google-sparsehash"

# Graph visualization software from AT&T and Bell Labs
brew "graphviz"

# GNU grep, egrep and fgrep
brew "grep"

# Improved top (interactive process viewer)
brew "htop"

# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"

# Lightweight and flexible command-line JSON processor
brew "jq"

# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"

# Pager program similar to more
brew "less"

# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"

# Portable Foreign Function Interface library
brew "libffi"

# Version of the SSL/TLS protocol forked from OpenSSL
brew "libressl"

# Generic library support script
brew "libtool"

# Vorbis General Audio Compression Codec
brew "libvorbis"

# VP8/VP9 video codec
brew "libvpx"

# GNOME XML library
brew "libxml2"

# YAML Parser
brew "libyaml"

# Next-gen compiler infrastructure
brew "llvm"

# Rainbows and unicorns in your console!
brew "lolcat"

# Clone of ls with colorful output, file type icons, and more
brew "lsd"

# Powerful, lightweight programming language
brew "lua"

# Package manager for the Lua programming language
brew "luarocks"

# Utility for directing compilation
brew "make"

# Hash utilities
brew "md5sha1sum"

# Unified display of technical and tag data for audio/video
brew "media-info"

# Scalable distributed version control system
brew "mercurial"

# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"

# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"

# Text-based UI library
brew "ncurses"

# Small build system for use with gyp or CMake
brew "ninja"

# Port scanning utility for large networks
brew "nmap"

# Platform built on V8 to build network applications
brew "node"

# General purpose programming language in the ML family
brew "ocaml"

# Regular expressions library
brew "oniguruma"

# Cryptography and SSL/TLS Toolkit
brew "openssl"

# Audio codec
brew "opus"

# 7-Zip (high compression file archiver) implementation
brew "p7zip"

# Perl compatible regular expressions library
brew "pcre"

# Manage compile and link flags for libraries
brew "pkg-config"

# Cowsay but with ponies
brew "ponysay"

# Python version management
brew "pyenv"

# State machine compiler
brew "ragel"

# Library for command-line editing
brew "readline"

# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"

# Powerful, clean, object-oriented scripting language
brew "ruby"

# Low-level access to audio, keyboard, mouse, joystick and graphics
brew "sdl"

# Autoformat shell script source code
brew "shfmt"

# Command-line interface for Spotify on a Mac
brew "shpotify"

# GNU's portable shell tool
brew "shtool"

# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"

# Generate scripting interfaces to C/C++ code
brew "swig"

# Tool Command Language
brew "tcl-tk"

# User interface to the TELNET protocol
brew "telnet"

# Convert TeXinfo files to HTML
brew "texi2html"

# Open video compression format
brew "theora"

# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"

# Lightweight BitTorrent client
brew "transmission-cli"

# CLI tool that moves files or folder to the trash
brew "trash"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Manipulate and analyze Unicode text
brew "uniutils"

# Extract, view, and test RAR archives
brew "unrar"

# Extraction utility for .zip compressed archives
brew "unzip"

# Internet file retriever
brew "wget"

# H.264/AVC encoder
brew "x264"

# H.265/HEVC encoder
brew "x265"

# High-performance, high-quality MPEG-4 video library
brew "xvid"

# General-purpose data compression with high compression ratio
brew "xz"

# Modular BSD reimplementation of NASM
brew "yasm"

# UNIX shell (command interpreter)
brew "zsh"
